# CurvesCollinear Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarShapeFailures..::..CurvesCollinear Property
BuiltInFailures..::..RebarShapeFailures Class See Also
---
Collinear segments are not allowed in a Rebar Shape definition.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CurvesCollinear { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CurvesCollinear As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CurvesCollinear {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarShapeFailures Class
Autodesk.Revit.DB Namespace